tahsinTH007/SFAS-BD-Smart-Fire-Alert-System-Bangladesh/firmware/ognibormo_esp32_portal/ognibormo_esp32_portal.ino
// =============================================================================
//  OGNIBORMO — ESP32 field unit  (SFAS-BD)
//
//  Battery powered, no USB, no serial console. Everything is configured from a
//  phone and every state is reported by the LED and the buzzer, because on a
//  battery there is nothing else to look at.
//
//  ── FIRST POWER-ON, OR A NEW WIFI ──────────────────────────────────────────
//   1. The unit finds no saved network and opens its own:
//          SSID      OGNIBORMO-SETUP
//          password  ognibormo
//      (LED blinks slowly, buzzer chirps twice every 5s.)
//   2. Join it from a phone. The setup page opens by itself; if it does not,
//      browse to  http://192.168.4.1
//   3. Pick the WiFi, type its password. Leave "Server address" on Auto and
//      the unit finds the backend by itself. Save — it reboots and connects.
//
//  ── LATER ──────────────────────────────────────────────────────────────────
//   The unit's own address shows in the dashboard under Units → Last seen.
//   Open it in a browser for a live status page and to change the server
//   without redoing the WiFi.
//
//   To force setup mode again: hold the BOOT button while switching on, keep
//   it held ~3s, until the buzzer gives one long beep.
//
//  ── WIRING — GPIO34 and GPIO26 are NOT 5V tolerant (3.6V max) ──────────────
//    MQ-2  : VCC->5V, GND->GND, A0 -> divider -> GPIO34
//            divider: A0 --[10k]--+--[20k]-- GND, tap (+) to GPIO34
//    Flame : power from 3.3V, D0 -> GPIO26
//    Buzzer: + -> GPIO25, - -> GND
// =============================================================================

#include <WiFi.h>
#include <HTTPClient.h>
#include <WebServer.h>
#include <DNSServer.h>
#include <Preferences.h>

// ─────────────────────────────────────────────────────────────────────────────
//  Pins and hardware options
// ─────────────────────────────────────────────────────────────────────────────
#define MQ2_A0             34    // ADC1_CH6, input-only
#define FLAME_D0           26
#define BUZZER             25
#define STATUS_LED          2    // on-board LED on most ESP32 devkits
#define BOOT_BUTTON         0    // BOOT button, LOW when pressed

#define FLAME_ACTIVE_LOW    1    // 0 if your flame module reports HIGH on flame
#define BUZZER_IS_ACTIVE    0    // 1 = active buzzer (has its own oscillator)
#define LED_ACTIVE_LOW      0    // 1 if your board's LED lights on LOW
#define HAS_DHT             0    // 1 once a real DHT22 is fitted
#define DHT_PIN            27

// On battery, modem sleep cuts the average draw roughly 3x. It adds ~100ms to
// a posted alert, which does not matter: the local siren is driven straight
// from the sensor and never waits for the network.
#define WIFI_POWER_SAVE     1

// Diagnostics over USB. The unit is designed to run headless on a battery, so
// nothing here is load-bearing — it is for bench testing, and costs one idle
// UART when the unit is deployed.
#define SERIAL_DEBUG        1
#define SERIAL_BAUD         115200

#if SERIAL_DEBUG
  #define DBG(x)      Serial.print(x)
  #define DBGLN(x)    Serial.println(x)
#else
  #define DBG(x)
  #define DBGLN(x)
#endif

// ─────────────────────────────────────────────────────────────────────────────
//  Setup-portal identity
// ─────────────────────────────────────────────────────────────────────────────
const char* AP_SSID = "OGNIBORMO-SETUP";
const char* AP_PASS = "ognibormo";        // WPA2 needs at least 8 characters

// ─────────────────────────────────────────────────────────────────────────────
//  Timing
// ─────────────────────────────────────────────────────────────────────────────
const uint32_t POST_IDLE_MS    = 3000;  // backend allows 120 posts / 60s
const uint32_t POST_ALARM_MS   = 1000;
const uint32_t HEARTBEAT_MS    = 30000; // makes the unit's IP show on the dashboard
const uint32_t SAMPLE_MS       = 250;
const uint32_t WARMUP_MS       = 20000; // MQ-2 preheat; set 0 to skip for a demo
const uint32_t BASELINE_MS     = 4000;
const uint32_t HTTP_TIMEOUT_MS = 4000;
const uint32_t WIFI_JOIN_MS    = 15000;

const uint32_t FIRE_BEEP_MS    = 120;
const uint32_t SMOKE_BEEP_MS   = 150;
const int      FIRE_TONE_HZ    = 2500;
const int      SMOKE_TONE_HZ   = 1500;

// ─────────────────────────────────────────────────────────────────────────────
//  Detection tuning
// ─────────────────────────────────────────────────────────────────────────────
const int     SMOKE_DELTA    = 250;   // alarm at baseline + this (raw counts)
const float   CLEAR_FRACTION = 0.6f;  // hysteresis: clear at 60% of the delta
const uint8_t CONFIRM_READS  = 3;

#if HAS_DHT
  #include <DHT.h>
  DHT dht(DHT_PIN, DHT22);
#endif

// ─────────────────────────────────────────────────────────────────────────────
//  Saved configuration (NVS — survives power loss)
// ─────────────────────────────────────────────────────────────────────────────
Preferences prefs;

String cfgSsid, cfgPass, cfgServer, cfgDevice;
uint16_t cfgPort = 8080;
bool cfgAutoDiscover = true;

void loadConfig() {
  prefs.begin("ognibormo", true);
  cfgSsid         = prefs.getString("ssid", "");
  cfgPass         = prefs.getString("pass", "");
  cfgServer       = prefs.getString("server", "");
  cfgDevice       = prefs.getString("device", "OGB-UTT-001");
  cfgPort         = prefs.getUShort("port", 8080);
  cfgAutoDiscover = prefs.getBool("auto", true);
  prefs.end();
}

void saveConfig() {
  prefs.begin("ognibormo", false);
  prefs.putString("ssid", cfgSsid);
  prefs.putString("pass", cfgPass);
  prefs.putString("server", cfgServer);
  prefs.putString("device", cfgDevice);
  prefs.putUShort("port", cfgPort);
  prefs.putBool("auto", cfgAutoDiscover);
  prefs.end();
}

void clearConfig() {
  prefs.begin("ognibormo", false);
  prefs.clear();
  prefs.end();
}

// ─────────────────────────────────────────────────────────────────────────────
//  State.  32-bit aligned scalars are atomic on the ESP32, so core 1 can write
//  and core 0 can read these without a mutex.
// ─────────────────────────────────────────────────────────────────────────────
enum LinkState { LINK_PORTAL, LINK_JOINING, LINK_NO_SERVER, LINK_ONLINE };

volatile LinkState g_link         = LINK_JOINING;
volatile int       g_smokeValue   = 0;
volatile bool      g_smokeAlarm   = false;
volatile bool      g_fireAlarm    = false;
volatile float     g_temperature  = 0.0f;
volatile float     g_humidity     = 0.0f;
volatile bool      g_dhtOk        = false;
volatile int       g_lastHttpCode = 0;
volatile int       g_riskScore    = -1;
volatile bool      g_rescanWanted = false;

int     smokeBaseline = 0;
int     smokeOnLevel  = 0;
int     smokeOffLevel = 0;
uint8_t smokeStreak   = 0;
uint8_t flameStreak   = 0;

uint32_t lastSample      = 0;
uint32_t lastBeep        = 0;
uint32_t lastLed         = 0;
uint32_t lastPortalChirp = 0;
uint8_t  ledPhase        = 0;
bool     buzzerOn        = false;

WebServer  server(80);
DNSServer  dns;
bool       portalMode = false;

