tahsinTH007/SFAS-BD-Smart-Fire-Alert-System-Bangladesh/firmware/ognibormo_esp32_portal/ognibormo_esp32_portal.ino
// =============================================================================
//  Buzzer — tone() exists only on ESP32 core 3.x; core 2.x needs LEDC
// =============================================================================
#if !BUZZER_IS_ACTIVE && (!defined(ESP_ARDUINO_VERSION_MAJOR) || ESP_ARDUINO_VERSION_MAJOR < 3)
  #define LEDC_CHANNEL 0
#endif

void buzzerSetup() {
  pinMode(BUZZER, OUTPUT);
  digitalWrite(BUZZER, LOW);
#ifdef LEDC_CHANNEL
  ledcSetup(LEDC_CHANNEL, 2000, 8);
  ledcAttachPin(BUZZER, LEDC_CHANNEL);
  ledcWrite(LEDC_CHANNEL, 0);
#endif
}

void beepOn(int freq) {
#if BUZZER_IS_ACTIVE
  (void)freq;  digitalWrite(BUZZER, HIGH);
#elif defined(LEDC_CHANNEL)
  ledcWriteTone(LEDC_CHANNEL, freq);
#else
  tone(BUZZER, freq);
#endif
}

void beepOff() {
#if BUZZER_IS_ACTIVE
  digitalWrite(BUZZER, LOW);
#elif defined(LEDC_CHANNEL)
  ledcWriteTone(LEDC_CHANNEL, 0);
#else
  noTone(BUZZER);
#endif
}

/** Blocking chirp. Only used at boot and on config changes, never in alarm. */
void chirp(int freq, int ms, int times = 1, int gap = 80) {
  for (int i = 0; i < times; i++) {
    beepOn(freq);
    delay(ms);
    beepOff();
    if (i < times - 1) delay(gap);
  }
}

void ledWrite(bool on) {
#if LED_ACTIVE_LOW
  digitalWrite(STATUS_LED, on ? LOW : HIGH);
#else
  digitalWrite(STATUS_LED, on ? HIGH : LOW);
#endif
}

/**
 * The LED is the only status display this unit has once it is on a battery,
 * so each link state gets a pattern that is distinguishable across a room.
 *
 *   slow blink   waiting to be set up   — join OGNIBORMO-SETUP
 *   fast blink   joining WiFi
 *   double-blink on WiFi, backend not reachable
 *   solid        online, readings landing on the dashboard
 */
void serviceLed(uint32_t now) {
  switch (g_link) {
    case LINK_PORTAL:
      if (now - lastLed >= 500) { lastLed = now; ledPhase ^= 1; ledWrite(ledPhase); }
      break;

    case LINK_JOINING:
      if (now - lastLed >= 150) { lastLed = now; ledPhase ^= 1; ledWrite(ledPhase); }
      break;

    case LINK_NO_SERVER: {
      // on-off-on-off--------  repeating every 1.4s
      uint32_t t = now % 1400;
      ledWrite(t < 120 || (t >= 260 && t < 380));
      break;
    }

    case LINK_ONLINE:
      ledWrite(true);
      break;
  }
}

// =============================================================================
//  Sensors
// =============================================================================
int readSmokeRaw() {
  long sum = 0;
  for (uint8_t i = 0; i < 8; i++) {
    sum += analogRead(MQ2_A0);
    delayMicroseconds(200);
  }
  return (int)(sum / 8);
}

bool readFlameRaw() {
  int v = digitalRead(FLAME_D0);
#if FLAME_ACTIVE_LOW
  return v == LOW;
#else
  return v == HIGH;
#endif
}

/**
 * MQ-2 has no absolute scale — clean-air output depends on the module's load
 * resistor, the supply and the sensor's age. Measure this unit's own clean air
 * at boot and alarm on the rise above it, rather than guessing a constant.
 */
void calibrateBaseline() {
  if (WARMUP_MS > 0) {
    uint32_t start = millis();
    while (millis() - start < WARMUP_MS) {
      ledWrite((millis() / 250) % 2);   // quick flicker = warming up
      delay(50);
    }
  }

  long sum = 0;
  int  n   = 0;
  uint32_t start = millis();
  while (millis() - start < BASELINE_MS) {
    sum += readSmokeRaw();
    n++;
    delay(50);
  }

  smokeBaseline = (int)(sum / n);
  smokeOnLevel  = smokeBaseline + SMOKE_DELTA;
  smokeOffLevel = smokeBaseline + (int)(SMOKE_DELTA * CLEAR_FRACTION);

  DBGLN("");
  DBG("Clean-air baseline : "); DBGLN(smokeBaseline);
  DBG("Siren above        : "); DBGLN(smokeOnLevel);
  DBG("Clears below       : "); DBGLN(smokeOffLevel);
  DBG("Set backend .env   : SMOKE_THRESHOLD=");
  DBGLN((smokeBaseline + SMOKE_DELTA) / 2);
  DBGLN("");
}

// =============================================================================
//  Web pages
// =============================================================================

const char* PAGE_CSS =
  "<style>"
  "*{box-sizing:border-box}"
  "body{margin:0;padding:20px;background:#0f172a;color:#e2e8f0;"
  "font:15px/1.5 system-ui,-apple-system,Segoe UI,Roboto,sans-serif}"
  ".w{max-width:420px;margin:0 auto}"
  "h1{font-size:19px;margin:0 0 4px;color:#fb923c}"
  ".sub{font-size:13px;color:#94a3b8;margin:0 0 20px}"
  "label{display:block;font-size:12px;text-transform:uppercase;letter-spacing:.05em;"
  "color:#94a3b8;margin:14px 0 5px}"
  "input,select{width:100%;padding:11px;background:#1e293b;color:#e2e8f0;"
  "border:1px solid #334155;border-radius:8px;font-size:15px}"
  "button{width:100%;margin-top:20px;padding:13px;background:#ea580c;color:#fff;"
  "border:0;border-radius:8px;font-size:15px;font-weight:600}"
  "button.alt{background:#334155;margin-top:10px}"
  "table{width:100%;border-collapse:collapse;font-size:14px}"
  "td{padding:7px 0;border-bottom:1px solid #1e293b}"
  "td:last-child{text-align:right;font-family:ui-monospace,monospace;color:#f1f5f9}"
  ".ok{color:#34d399}.bad{color:#f87171}.warn{color:#fbbf24}"
  "</style>";

/** Setup portal: pick a network, set where the backend lives. */
void handlePortalRoot() {
  String html = "<!doctype html><meta name=viewport content='width=device-width,initial-scale=1'>";
  html += "<title>OGNIBORMO setup</title>";
  html += PAGE_CSS;
  html += "<div class=w><h1>OGNIBORMO unit</h1>";
  html += "<p class=sub>Connect this unit to the WiFi that the SFAS-BD dashboard is on.</p>";
  html += "<form method=POST action=/save>";

  html += "<label>WiFi network</label><select name=ssid>";
  int n = WiFi.scanNetworks();
  for (int i = 0; i < n; i++) {
    html += "<option value='" + WiFi.SSID(i) + "'>" + WiFi.SSID(i);
    html += "  (" + String(WiFi.RSSI(i)) + " dBm)</option>";
  }
  if (n == 0) html += "<option value=''>-- no networks found --</option>";
  html += "</select>";

  html += "<label>WiFi password</label><input name=pass type=password value='" + cfgPass + "'>";

  html += "<label>Unit code</label><input name=device value='" + cfgDevice + "'>";

  html += "<label>Server address</label>";
  html += "<input name=server placeholder='leave empty to find it automatically' value='" + cfgServer + "'>";

  html += "<label>Server port</label><input name=port value='" + String(cfgPort) + "'>";

  html += "<button type=submit>Save and connect</button></form></div>";

  server.send(200, "text/html", html);
}

void handlePortalSave() {
  cfgSsid   = server.arg("ssid");
  cfgPass   = server.arg("pass");
  cfgDevice = server.arg("device");
  cfgServer = server.arg("server");
  cfgServer.trim();
  cfgPort   = (uint16_t)server.arg("port").toInt();
  if (cfgPort == 0) cfgPort = 8080;
  cfgAutoDiscover = (cfgServer.length() == 0);

