tahsinTH007/SFAS-BD-Smart-Fire-Alert-System-Bangladesh/firmware/ognibormo_esp32_portal/ognibormo_esp32_portal.ino
  saveConfig();

  String html = "<!doctype html><meta name=viewport content='width=device-width,initial-scale=1'>";
  html += PAGE_CSS;
  html += "<div class=w><h1>Saved</h1><p class=sub>Connecting to <b>" + cfgSsid + "</b>.";
  html += " The unit restarts now. When the LED stays solid it is online and reporting.";
  html += " Its address will appear in the dashboard under Units.</p></div>";
  server.send(200, "text/html", html);

  delay(1200);
  ESP.restart();
}

/** Live status page, served at the unit's own address once it is on the WiFi. */
void handleStatusRoot() {
  String html = "<!doctype html><meta name=viewport content='width=device-width,initial-scale=1'>";
  html += "<meta http-equiv=refresh content=10>";
  html += "<title>" + cfgDevice + "</title>";
  html += PAGE_CSS;
  html += "<div class=w><h1>" + cfgDevice + "</h1>";
  html += "<p class=sub>OGNIBORMO field unit</p><table>";

  html += "<tr><td>WiFi</td><td>" + WiFi.SSID() + "</td></tr>";
  html += "<tr><td>Signal</td><td>" + String(WiFi.RSSI()) + " dBm</td></tr>";
  html += "<tr><td>This unit</td><td>" + WiFi.localIP().toString() + "</td></tr>";
  html += "<tr><td>Backend</td><td>" + (cfgServer.length() ? cfgServer + ":" + String(cfgPort)
                                                           : String("not found")) + "</td></tr>";

  html += "<tr><td>Link</td><td class=";
  if (g_link == LINK_ONLINE)          html += "ok>reporting";
  else if (g_link == LINK_NO_SERVER)  html += "bad>backend unreachable";
  else                                html += "warn>connecting";
  html += "</td></tr>";

  if (g_lastHttpCode) html += "<tr><td>Last response</td><td>HTTP " + String(g_lastHttpCode) + "</td></tr>";
  if (g_riskScore >= 0) html += "<tr><td>Backend risk</td><td>" + String(g_riskScore) + "/100</td></tr>";

  html += "<tr><td>Smoke</td><td>" + String(g_smokeValue) + " / base " + String(smokeBaseline) + "</td></tr>";
  html += "<tr><td>Alarms above</td><td>" + String(smokeOnLevel) + "</td></tr>";

  html += "<tr><td>State</td><td class=";
  if (g_fireAlarm)       html += "bad>FIRE";
  else if (g_smokeAlarm) html += "bad>SMOKE";
  else                   html += "ok>normal";
  html += "</td></tr>";

#if HAS_DHT
  if (g_dhtOk) {
    html += "<tr><td>Temperature</td><td>" + String(g_temperature, 1) + " C</td></tr>";
    html += "<tr><td>Humidity</td><td>" + String(g_humidity, 1) + " %</td></tr>";
  }
#else
  html += "<tr><td>Temperature</td><td>no sensor fitted</td></tr>";
#endif
  html += "</table>";

  html += "<form method=POST action=/server>";
  html += "<label>Backend address</label><input name=server value='" + cfgServer + "'>";
  html += "<label>Port</label><input name=port value='" + String(cfgPort) + "'>";
  html += "<button type=submit>Save server</button></form>";

  html += "<form method=POST action=/rescan><button class=alt type=submit>Search the network for the backend</button></form>";
  html += "<form method=POST action=/forget onsubmit=\"return confirm('Forget the WiFi and reopen setup?')\">";
  html += "<button class=alt type=submit>Forget WiFi and reopen setup</button></form>";
  html += "</div>";

  server.send(200, "text/html", html);
}

void handleSetServer() {
  cfgServer = server.arg("server");
  cfgServer.trim();
  cfgPort = (uint16_t)server.arg("port").toInt();
  if (cfgPort == 0) cfgPort = 8080;
  cfgAutoDiscover = (cfgServer.length() == 0);
  saveConfig();

  server.sendHeader("Location", "/");
  server.send(303);
}

void handleRescan() {
  g_rescanWanted = true;
  server.sendHeader("Location", "/");
  server.send(303);
}

void handleForget() {
  clearConfig();
  server.send(200, "text/html",
              "<!doctype html><body style='background:#0f172a;color:#e2e8f0;"
              "font:15px system-ui;padding:24px'>WiFi cleared. Restarting into "
              "setup mode — join <b>OGNIBORMO-SETUP</b>.");
  delay(1200);
  ESP.restart();
}

// =============================================================================
//  Setup portal (AP mode)
// =============================================================================
void startPortal() {
  portalMode = true;
  g_link = LINK_PORTAL;

  WiFi.mode(WIFI_AP_STA);          // STA too, so the network scan works
  WiFi.softAP(AP_SSID, AP_PASS);
  delay(300);

  dns.start(53, "*", WiFi.softAPIP());   // catch-all DNS → captive portal

  server.on("/save", HTTP_POST, handlePortalSave);
  server.onNotFound(handlePortalRoot);   // any URL opens the setup page
  server.begin();

  chirp(1200, 400);   // one long beep = "I am waiting to be set up"
}

// =============================================================================
//  Backend discovery — find the dashboard PC without being told its address
// =============================================================================

/** True if something on this address answers the SFAS-BD health endpoint. */
bool probeBackend(IPAddress ip, uint16_t port) {
  WiFiClient c;
  if (!c.connect(ip, port, 180)) return false;

  c.print(String("GET /api/v1/health/live HTTP/1.1\r\nHost: ") +
          ip.toString() + "\r\nConnection: close\r\n\r\n");

  uint32_t start = millis();
  String head;
  while (c.connected() && millis() - start < 700 && head.length() < 400) {
    while (c.available()) head += (char)c.read();
  }
  c.stop();

  // The health route answers {"status":"ok",...} — enough to tell it apart
  // from whatever else might happen to be listening on this port.
  return head.indexOf("\"status\"") >= 0;
}

/**
 * Walks the unit's own /24. The dashboard PC is on the same router by design,
 * so this is bounded and only ever runs once per network — the result is saved.
 * Runs on core 0, so the siren is unaffected while it works.
 */
bool discoverBackend() {
  IPAddress me = WiFi.localIP();
  IPAddress gw = WiFi.gatewayIP();

  DBGLN("[net] searching the network for the SFAS-BD backend...");

  // The router itself is the least likely host and the slowest to answer, so
  // try the gateway last and walk the rest in order.
  for (int i = 2; i <= 254; i++) {
    if (IPAddress(me[0], me[1], me[2], i) == me) continue;
    if (probeBackend(IPAddress(me[0], me[1], me[2], i), cfgPort)) {
      cfgServer = IPAddress(me[0], me[1], me[2], i).toString();
      saveConfig();
      DBG("[net] backend found at "); DBGLN(cfgServer);
      return true;
    }
    if ((i & 0x0F) == 0) vTaskDelay(pdMS_TO_TICKS(1));  // stay friendly to the RTOS
  }

  if (probeBackend(gw, cfgPort)) {
    cfgServer = gw.toString();
    saveConfig();
    return true;
  }
  return false;
}

