tahsinTH007/SFAS-BD-Smart-Fire-Alert-System-Bangladesh/firmware/ognibormo_esp32_portal/ognibormo_esp32_portal.ino
// =============================================================================
//  Network task — core 0, free to block
// =============================================================================

void sendHeartbeat() {
  if (!cfgServer.length()) return;

  HTTPClient http;
  http.setTimeout(HTTP_TIMEOUT_MS);
  http.setConnectTimeout(HTTP_TIMEOUT_MS);

  String url = "http://" + cfgServer + ":" + String(cfgPort) + "/api/v1/devices/heartbeat";
  if (!http.begin(url)) return;

  http.addHeader("Content-Type", "application/json");
  // The backend records the address this request arrived from, which is how
  // the unit's IP reaches the dashboard without it being typed anywhere.
  http.POST("{\"deviceCode\":\"" + cfgDevice + "\"}");
  http.end();
}

void postReading() {
  if (!cfgServer.length()) { g_link = LINK_NO_SERVER; return; }

  // MQ-2 feeds "smoke" only. It also responds to LPG, but sending the same
  // number as "gas" would make riskEngine treat one sensor as two agreeing
  // sources and inflate the fused score.
  String body = "{\"deviceCode\":\"" + cfgDevice + "\",\"smoke\":" + String(g_smokeValue) +
                ",\"fire\":" + String(g_fireAlarm ? 1 : 0);
  if (g_dhtOk) {
    body += ",\"temp\":" + String(g_temperature, 1) +
            ",\"humidity\":" + String(g_humidity, 1);
  }
  body += "}";

  HTTPClient http;
  http.setTimeout(HTTP_TIMEOUT_MS);
  http.setConnectTimeout(HTTP_TIMEOUT_MS);

  String url = "http://" + cfgServer + ":" + String(cfgPort) + "/api/v1/sensors/readings";
  if (!http.begin(url)) { g_link = LINK_NO_SERVER; return; }

  http.addHeader("Content-Type", "application/json");
  int code = http.POST(body);
  g_lastHttpCode = code;

  if (code > 0) {
    String reply = http.getString();
    int at = reply.indexOf("\"riskScore\":");
    g_riskScore = (at >= 0) ? reply.substring(at + 12).toInt() : -1;
    g_link = (code < 400 || code == 429) ? LINK_ONLINE : LINK_NO_SERVER;
  } else {
    g_link = LINK_NO_SERVER;
    g_riskScore = -1;
  }

  http.end();
}

bool joinWifi() {
  g_link = LINK_JOINING;

  WiFi.mode(WIFI_STA);
#if WIFI_POWER_SAVE
  WiFi.setSleep(true);
#else
  WiFi.setSleep(false);
#endif
  WiFi.setAutoReconnect(true);
  WiFi.begin(cfgSsid.c_str(), cfgPass.c_str());

  uint32_t start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < WIFI_JOIN_MS) {
    vTaskDelay(pdMS_TO_TICKS(250));
  }

  if (WiFi.status() == WL_CONNECTED) {
    DBG("[net] joined "); DBG(cfgSsid);
    DBG("  unit IP: ");   DBGLN(WiFi.localIP());
    return true;
  }
  DBG("[net] could not join "); DBGLN(cfgSsid);

#if SERIAL_DEBUG
  // Distinguish the failures that look identical from the outside: an AP that
  // is not there, a wrong password, and an AP whose security this radio cannot
  // speak. Without this the only symptom is an endless "joining".
  Serial.print("[net] status code ");
  Serial.print((int)WiFi.status());
  Serial.println("  (1=SSID not found, 4=auth failed, 6=disconnected)");

  int n = WiFi.scanNetworks();
  bool seen = false;
  for (int i = 0; i < n; i++) {
    if (WiFi.SSID(i) != cfgSsid) continue;
    seen = true;
    Serial.print("[net] AP visible, rssi ");
    Serial.print(WiFi.RSSI(i));
    Serial.print(" dBm, security: ");
    switch (WiFi.encryptionType(i)) {
      case WIFI_AUTH_OPEN:           Serial.println("open"); break;
      case WIFI_AUTH_WPA_PSK:        Serial.println("WPA - ok"); break;
      case WIFI_AUTH_WPA2_PSK:       Serial.println("WPA2 - ok"); break;
      case WIFI_AUTH_WPA_WPA2_PSK:   Serial.println("WPA/WPA2 - ok"); break;
      case WIFI_AUTH_WPA2_WPA3_PSK:  Serial.println("WPA2/WPA3 mixed - ok"); break;
      case WIFI_AUTH_WPA3_PSK:
        Serial.println("WPA3-ONLY");
        Serial.println("[net] >> switch the hotspot to WPA2 or WPA2/WPA3 mixed");
        break;
      default:                       Serial.println("unknown"); break;
    }
  }
  if (!seen) Serial.println("[net] AP not found in scan - is it switched on?");
  WiFi.scanDelete();
#endif

  return false;
}

void netTask(void* pv) {
  (void)pv;

  uint32_t lastHeartbeat = 0;
  bool announced   = false;
  bool httpStarted = false;

  for (;;) {
    if (WiFi.status() != WL_CONNECTED) {
      g_link = LINK_JOINING;
      announced = false;
      if (!joinWifi()) {
        vTaskDelay(pdMS_TO_TICKS(5000));
        continue;
      }
      // Station-mode status page, reachable at the unit's own address. Routes
      // are registered once for the life of the process — WebServer::on()
      // appends, so re-registering them on every reconnect would pile up
      // duplicate handlers and leak the heap this unit cannot spare.
      if (!httpStarted) {
        httpStarted = true;
        server.on("/server", HTTP_POST, handleSetServer);
        server.on("/rescan", HTTP_POST, handleRescan);
        server.on("/forget", HTTP_POST, handleForget);
        server.onNotFound(handleStatusRoot);
        server.begin();
      }
    }

    if (g_rescanWanted) {
      g_rescanWanted = false;
      cfgServer = "";
      discoverBackend();
    }

    if (!cfgServer.length() && cfgAutoDiscover) {
      g_link = LINK_NO_SERVER;
      discoverBackend();
    }

    if (cfgServer.length()) {
      if (millis() - lastHeartbeat >= HEARTBEAT_MS) {
        lastHeartbeat = millis();
        sendHeartbeat();
      }
      postReading();

      if (!announced && g_link == LINK_ONLINE) {
        announced = true;
        chirp(1800, 90, 2);   // two quick chirps = online and reporting
      }
    }

    uint32_t wait = (g_fireAlarm || g_smokeAlarm) ? POST_ALARM_MS : POST_IDLE_MS;
    vTaskDelay(pdMS_TO_TICKS(wait));
  }
}

// =============================================================================
//  Setup
// =============================================================================
void setup() {
#if SERIAL_DEBUG
  Serial.begin(SERIAL_BAUD);
  delay(300);
  Serial.println();
  Serial.println("==============================================");
  Serial.println("        OGNIBORMO  /  SFAS-BD  UNIT");
  Serial.println("==============================================");
#endif

  pinMode(FLAME_D0, INPUT);
  pinMode(STATUS_LED, OUTPUT);
  pinMode(BOOT_BUTTON, INPUT_PULLUP);
  buzzerSetup();
  ledWrite(false);

  analogReadResolution(12);                    // 0..4095
  analogSetPinAttenuation(MQ2_A0, ADC_11db);   // full ~0-3.3V span

