tahsinTH007/SFAS-BD-Smart-Fire-Alert-System-Bangladesh/firmware/ognibormo_esp32_portal/ognibormo_esp32_portal.ino
#if HAS_DHT
  dht.begin();
#endif

  chirp(2000, 60);   // one short chirp = powered up

  // Hold BOOT through power-on to wipe the saved WiFi and reopen setup. This
  // is the only recovery path on a unit with no serial console.
  uint32_t held = millis();
  while (digitalRead(BOOT_BUTTON) == LOW) {
    if (millis() - held > 3000) {
      clearConfig();
      chirp(900, 500);
      break;
    }
    delay(20);
  }

  loadConfig();

  DBG("Unit code          : "); DBGLN(cfgDevice);
  DBG("Saved WiFi         : ");
  DBGLN(cfgSsid.length() ? cfgSsid : String("(none - will open setup portal)"));
  DBG("Saved backend      : ");
  DBGLN(cfgServer.length() ? cfgServer + ":" + String(cfgPort)
                           : String("(none - will search the network)"));
  DBGLN("Warming up MQ-2, keep the air clean...");

  calibrateBaseline();

  if (cfgSsid.length() == 0) {
    DBGLN("No WiFi saved. Join 'OGNIBORMO-SETUP' (password: ognibormo)");
    DBGLN("then open http://192.168.4.1 if the page does not appear.");
    startPortal();
    return;                       // loop() services the portal
  }

  // Core 0 owns the network. loop() owns core 1 and never blocks, so the siren
  // keeps its timing even while an HTTP request is stalled or a scan is running.
  xTaskCreatePinnedToCore(netTask, "net", 8192, nullptr, 1, nullptr, 0);
}

// =============================================================================
//  Loop — core 1: sensors, siren, status LED. Nothing blocks here.
// =============================================================================
void loop() {
  uint32_t now = millis();

  if (portalMode) dns.processNextRequest();
  server.handleClient();

  if (now - lastSample >= SAMPLE_MS) {
    lastSample = now;

    int  smokeValue = readSmokeRaw();
    bool flameNow   = readFlameRaw();
    g_smokeValue = smokeValue;

    // Hysteresis: rise past the on-level for CONFIRM_READS samples to alarm,
    // fall below the lower off-level to clear. Stops the buzzer chattering
    // when the reading sits right on the boundary.
    if (!g_smokeAlarm) {
      smokeStreak = (smokeValue > smokeOnLevel) ? smokeStreak + 1 : 0;
      if (smokeStreak >= CONFIRM_READS) g_smokeAlarm = true;
    } else if (smokeValue < smokeOffLevel) {
      g_smokeAlarm = false;
      smokeStreak  = 0;
    }

    // An IR flame sensor trips on sunlight and hot elements, so require two
    // consecutive reads before believing it.
    if (flameNow) { if (flameStreak < 2) flameStreak++; }
    else          { flameStreak = 0; }
    g_fireAlarm = (flameStreak >= 2);

#if HAS_DHT
    float t = dht.readTemperature();
    float h = dht.readHumidity();
    g_dhtOk = !isnan(t) && !isnan(h);
    if (g_dhtOk) { g_temperature = t; g_humidity = h; }
#endif

#if SERIAL_DEBUG
    // One line per sample, so the bench test reads as a stream rather than a
    // wall of blocks. Printed every 4th sample (~1s) to stay readable.
    static uint8_t tick = 0;
    if (++tick >= 4) {
      tick = 0;
      Serial.print("smoke ");
      Serial.print(smokeValue);
      Serial.print("/");
      Serial.print(smokeOnLevel);
      Serial.print("  flame ");
      Serial.print(g_fireAlarm ? "YES" : "no ");
      Serial.print("  | ");
      if (g_fireAlarm)       Serial.print("FIRE ALARM ");
      else if (g_smokeAlarm) Serial.print("SMOKE ALARM");
      else                   Serial.print("normal     ");
      Serial.print("  | link ");
      switch (g_link) {
        case LINK_ONLINE:    Serial.print("online"); break;
        case LINK_NO_SERVER: Serial.print("no backend"); break;
        case LINK_JOINING:   Serial.print("joining"); break;
        case LINK_PORTAL:    Serial.print("setup portal"); break;
      }
      if (g_riskScore >= 0) { Serial.print("  risk "); Serial.print(g_riskScore); }
      Serial.println();
    }
#endif
  }

  // ── Siren — the alarm is local and owns the buzzer whenever it is active ───
  if (g_fireAlarm || g_smokeAlarm) {
    uint32_t period = g_fireAlarm ? FIRE_BEEP_MS : SMOKE_BEEP_MS;
    int      freq   = g_fireAlarm ? FIRE_TONE_HZ : SMOKE_TONE_HZ;

    if (now - lastBeep >= period) {
      lastBeep = now;
      buzzerOn = !buzzerOn;
      if (buzzerOn) beepOn(freq);
      else          beepOff();
    }
    ledWrite((now / 100) % 2);      // LED tracks the siren during an alarm
  } else {
    if (buzzerOn) { beepOff(); buzzerOn = false; }

    // Portal mode chirps every few seconds, so a unit left waiting for setup
    // in a cupboard is not silently doing nothing.
    if (portalMode && now - lastPortalChirp >= 5000) {
      lastPortalChirp = now;
      chirp(1400, 60, 2);
    }

    serviceLed(now);
  }

  delay(2);   // yields to the RTOS; far finer than the beep period
}
